src/MOVED_XRoadFolkRaw/GetPerson.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xro="http://x-road.eu/xsd/xroad.xsd" xmlns:iden="http://x-road.eu/xsd/identifiers" xmlns:x="http://x-road.eu/xsd/x-road.xsd" xmlns:prod="http://us-folk-v2.x-road.eu/producer">
   <soapenv:Header>
      <xro:service iden:objectType="SERVICE">
         <iden:xRoadInstance>FO</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>405388</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>us-folk-v2</iden:subsystemCode>
         <iden:serviceCode>GetPerson</iden:serviceCode>
         <!--Optional:-->
         <iden:serviceVersion>v1</iden:serviceVersion>
      </xro:service>
      <xro:client iden:objectType="SUBSYSTEM">
         <iden:xRoadInstance>FO</iden:xRoadInstance>
         <iden:memberClass>GOV</iden:memberClass>
         <iden:memberCode>345334</iden:memberCode>
         <!--Optional:-->
         <iden:subsystemCode>HN-Tardis</iden:subsystemCode>
      </xro:client>
      <xro:id>123</xro:id>
      <xro:protocolVersion>4.0</xro:protocolVersion>
      <x:service>us-folk-v2.GetPerson.v1</x:service>
      <x:id>?</x:id>
      <x:userId>?</x:userId>
      <x:producer>us-folk-v2</x:producer>
      <x:consumer>345334</x:consumer>
   </soapenv:Header>
<soapenv:Body>
      <prod:GetPerson>
         <request>
            <requestBody>
               <!--Optional:-->
               <!--<Id>?</Id>-->
               <!--Optional:-->
               <PublicId></PublicId>
               <!--Optional:-->
               <!--<ExternalId>?</ExternalId>-->
               <!--Optional:-->
               <IncludeAddresses>true</IncludeAddresses>
               <!--Optional:-->
               <IncludeAddressesHistory>true</IncludeAddressesHistory>
               <!--Optional:-->
               <IncludeBiologicalParents>true</IncludeBiologicalParents>
               <!--Optional:-->
               <IncludeChurchMembership>true</IncludeChurchMembership>
               <!--Optional:-->
               <IncludeChurchMembershipHistory>true</IncludeChurchMembershipHistory>
               <!--Optional:-->
               <IncludeCitizenships>true</IncludeCitizenships>
               <!--Optional:-->
               <IncludeCitizenshipsHistory>true</IncludeCitizenshipsHistory>
               <!--Optional:-->
               <IncludeCivilStatus>true</IncludeCivilStatus>
               <!--Optional:-->
               <IncludeCivilStatusHistory>true</IncludeCivilStatusHistory>
               <!--Optional:-->
               <IncludeForeignSsns>true</IncludeForeignSsns>
               <!--Optional:-->
               <IncludeIncapacity>true</IncludeIncapacity>
               <!--Optional:-->
               <IncludeIncapacityHistory>true</IncludeIncapacityHistory>
               <!--Optional:-->
               <IncludeJuridicalChildren>true</IncludeJuridicalChildren>
               <!--Optional:-->
               <IncludeJuridicalChildrenHistory>true</IncludeJuridicalChildrenHistory>
               <!--Optional:-->
               <IncludeJuridicalParents>true</IncludeJuridicalParents>
               <!--Optional:-->
               <IncludeJuridicalParentsHistory>true</IncludeJuridicalParentsHistory>
               <!--Optional:-->
               <IncludeNames>true</IncludeNames>
               <!--Optional:-->
               <IncludeNamesHistory>true</IncludeNamesHistory>
               <!--Optional:-->
               <IncludeNotes>true</IncludeNotes>
               <!--Optional:-->
               <IncludeNotesHistory>true</IncludeNotesHistory>
               <!--Optional:-->
               <IncludePostbox>true</IncludePostbox>
               <!--Optional:-->
               <IncludeSpecialMarks>true</IncludeSpecialMarks>
               <!--Optional:-->
               <IncludeSpecialMarksHistory>true</IncludeSpecialMarksHistory>
               <!--Optional:-->
               <IncludeSpouse>true</IncludeSpouse>
               <!--Optional:-->
               <IncludeSpouseHistory>true</IncludeSpouseHistory>
               <!--Optional:-->
               <IncludeSsn>true</IncludeSsn>
               <!--Optional:-->
               <IncludeSsnHistory>true</IncludeSsnHistory>
            </requestBody>
            <requestHeader>
               <token></token>
            </requestHeader>
         </request>
      </prod:GetPerson>
   </soapenv:Body>
</soapenv:Envelope>